In [6]:
from pandas import Series
from pandas import DataFrame
import numpy as np

In [3]:
s = Series([1,2,3,np.nan,4,np.nan,5])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    NaN
6    5.0
dtype: float64

In [4]:
s.dropna()

0    1.0
1    2.0
2    3.0
4    4.0
6    5.0
dtype: float64

In [20]:
data = DataFrame([[1,2,3],[np.nan,np.nan,np.nan],[2,np.nan,4],[np.nan,3,np.nan]])
data

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  NaN
2  2.0  NaN  4.0
3  NaN  3.0  NaN

In [21]:
data.dropna()

     0    1    2
0  1.0  2.0  3.0

In [22]:
data.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
2  2.0  NaN  4.0
3  NaN  3.0  NaN

In [23]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  NaN
2  2.0  NaN  4.0
3  NaN  3.0  NaN

In [24]:
data[3]=np.nan
data

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  NaN  NaN  NaN NaN
2  2.0  NaN  4.0 NaN
3  NaN  3.0  NaN NaN

In [25]:
data = data.dropna(how='all',axis=1)
data

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  NaN
2  2.0  NaN  4.0
3  NaN  3.0  NaN

In [26]:
data = data.dropna(how='all')
data

     0    1    2
0  1.0  2.0  3.0
2  2.0  NaN  4.0
3  NaN  3.0  NaN

In [27]:
data = data.fillna(0)
data

     0    1    2
0  1.0  2.0  3.0
2  2.0  0.0  4.0
3  0.0  3.0  0.0